In [25]:
import pandas as pd
import numpy as np
from datetime import datetime
from datetime import timedelta
import time

In [26]:
df = pd.read_csv('./course-files/marathon_results_2016.csv', index_col='Bib',
usecols=['Bib','40K','Half','Pace','Age','M/F','Country','State','City'])
df['40K'] = df['40K'].apply(pd.to_timedelta)
df['Half'] = df['Half'].apply(pd.to_timedelta)
df['TotalSeconds'] = df['40K'].apply(lambda x: timedelta.total_seconds(x))
df['HalfSeconds'] = df['Half'].apply(lambda x: timedelta.total_seconds(x))

In [27]:
df.head()

,Age,M/F,City,State,Country,Half,40K,Pace,TotalSeconds,HalfSeconds
Bib,,,,,,,,,,
5,21,M,Addis Ababa,NaN,ETH,01:06:45,02:05:59,0:05:04,7559.0,4005.0
1,26,M,Ambo,NaN,ETH,01:06:46,02:05:59,0:05:06,7559.0,4006.0
6,31,M,Addis Ababa,NaN,ETH,01:06:44,02:06:47,0:05:07,7607.0,4004.0
11,33,M,Kitale,NaN,KEN,01:06:46,02:06:47,0:05:07,7607.0,4006.0
14,23,M,Eldoret,NaN,KEN,01:06:46,02:08:11,0:05:11,7691.0,4006.0

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 26630 entries, 5 to 28487
Data columns (total 10 columns):
Age             26630 non-null int64
M/F             26630 non-null object
City            26629 non-null object
State           23783 non-null object
Country         26630 non-null object
Half            26630 non-null timedelta64[ns]
40K             26630 non-null timedelta64[ns]
Pace            26630 non-null object
TotalSeconds    26630 non-null float64
HalfSeconds     26630 non-null float64
dtypes: float64(2), int64(1), object(5), timedelta64[ns](2)
memory usage: 2.2+ MB

In [29]:
df.describe()

,Age,Half,40K,TotalSeconds,HalfSeconds
count,26630.000000,26630,26630,26630.000000,26630.000000
mean,42.514044,0 days 01:49:25.497070,0 days 03:41:49.984829,13309.984829,6565.497071
std,11.347955,0 days 00:18:06.943013,0 days 00:39:13.302840,2353.302841,1086.943013
min,18.000000,0 days 00:00:00,0 days 00:00:00,0.000000,0.000000
25%,34.000000,0 days 01:36:51,0 days 03:14:50.250000,11690.250000,5811.000000
50%,43.000000,0 days 01:47:00,0 days 03:35:13,12913.000000,6420.000000
75%,51.000000,0 days 01:58:32,0 days 04:02:20,14540.000000,7112.000000
max,83.000000,0 days 04:47:17,0 days 07:59:12,28752.000000,17237.000000

In [30]:
df.nunique()

Age               65
M/F                2
City            5832
State             67
Country           79
Half            4825
40K             8610
Pace             546
TotalSeconds    8610
HalfSeconds     4825
dtype: int64

In [31]:
cities = df['City'].unique()

In [32]:
cities

array(['Addis Ababa', 'Ambo', 'Kitale', ..., 'Justin', 'Rossmoor',
       'Reedsburg'], dtype=object)

In [33]:
groups = {}

In [ ]:
for city in cities:
    myOwnFrame = df.where(df['City'] == city).dropna()
    groups[city] = myOwnFrame

In [ ]:
groups.describe()